; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p14---int100n150-m25---int100c110---s286---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level15 level15)
(sum level0 level21 level21)
(sum level0 level22 level22)
(sum level1 level3 level4)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level15 level16)
(sum level1 level21 level22)
(sum level1 level22 level23)
(sum level2 level3 level5)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level15 level17)
(sum level2 level21 level23)
(sum level2 level22 level24)
(sum level3 level3 level6)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level15 level18)
(sum level3 level21 level24)
(sum level3 level22 level25)
(sum level4 level3 level7)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level15 level19)
(sum level4 level21 level25)
(sum level4 level22 level26)
(sum level5 level3 level8)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level15 level20)
(sum level5 level21 level26)
(sum level5 level22 level27)
(sum level6 level3 level9)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level15 level21)
(sum level6 level21 level27)
(sum level6 level22 level28)
(sum level7 level3 level10)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level15 level22)
(sum level7 level21 level28)
(sum level7 level22 level29)
(sum level8 level3 level11)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level15 level23)
(sum level8 level21 level29)
(sum level8 level22 level30)
(sum level9 level3 level12)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level15 level24)
(sum level9 level21 level30)
(sum level9 level22 level31)
(sum level10 level3 level13)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level15 level25)
(sum level10 level21 level31)
(sum level10 level22 level32)
(sum level11 level3 level14)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level15 level26)
(sum level11 level21 level32)
(sum level11 level22 level33)
(sum level12 level3 level15)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level15 level27)
(sum level12 level21 level33)
(sum level12 level22 level34)
(sum level13 level3 level16)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level15 level28)
(sum level13 level21 level34)
(sum level13 level22 level35)
(sum level14 level3 level17)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level15 level29)
(sum level14 level21 level35)
(sum level14 level22 level36)
(sum level15 level3 level18)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level15 level30)
(sum level15 level21 level36)
(sum level15 level22 level37)
(sum level16 level3 level19)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level15 level31)
(sum level16 level21 level37)
(sum level16 level22 level38)
(sum level17 level3 level20)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level15 level32)
(sum level17 level21 level38)
(sum level17 level22 level39)
(sum level18 level3 level21)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level15 level33)
(sum level18 level21 level39)
(sum level18 level22 level40)
(sum level19 level3 level22)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level15 level34)
(sum level19 level21 level40)
(sum level19 level22 level41)
(sum level20 level3 level23)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level15 level35)
(sum level20 level21 level41)
(sum level20 level22 level42)
(sum level21 level3 level24)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level15 level36)
(sum level21 level21 level42)
(sum level22 level3 level25)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level15 level37)
(sum level23 level3 level26)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level15 level38)
(sum level24 level3 level27)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level15 level39)
(sum level25 level3 level28)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level15 level40)
(sum level26 level3 level29)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level15 level41)
(sum level27 level3 level30)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level15 level42)
(sum level28 level3 level31)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level29 level3 level32)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level30 level3 level33)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level31 level3 level34)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level32 level3 level35)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level33 level3 level36)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level34 level3 level37)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level35 level3 level38)
(sum level35 level7 level42)
(sum level36 level3 level39)
(sum level37 level3 level40)
(sum level38 level3 level41)
(sum level39 level3 level42)

(connected l0 l1)
(fuelcost level22 l0 l1)
(connected l0 l2)
(fuelcost level8 l0 l2)
(connected l0 l3)
(fuelcost level3 l0 l3)
(connected l1 l0)
(fuelcost level22 l1 l0)
(connected l1 l2)
(fuelcost level21 l1 l2)
(connected l1 l3)
(fuelcost level7 l1 l3)
(connected l2 l0)
(fuelcost level8 l2 l0)
(connected l2 l1)
(fuelcost level21 l2 l1)
(connected l2 l3)
(fuelcost level15 l2 l3)
(connected l3 l0)
(fuelcost level3 l3 l0)
(connected l3 l1)
(fuelcost level7 l3 l1)
(connected l3 l2)
(fuelcost level15 l3 l2)

(at t0 l0)
(fuel t0 level42)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l3)
(at p3 l0)
(at p4 l2)
(at p5 l1)
(at p6 l3)
(at p7 l2)
(at p8 l2)
(at p9 l2)
(at p10 l2)
(at p11 l0)
(at p12 l1)
(at p13 l3)
)

(:goal
(and
(at p0 l3)
(at p1 l1)
(at p2 l0)
(at p3 l2)
(at p4 l3)
(at p5 l3)
(at p6 l2)
(at p7 l1)
(at p8 l0)
(at p9 l0)
(at p10 l3)
(at p11 l1)
(at p12 l3)
(at p13 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 14
2. (drive t0 l0 l3 level39 level3 level42)
   deleted: (at t0 l0) (fuel t0 level42)
   added: (at t0 l3) (fuel t0 level39)
   goals met: 0 of 14
3. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 1 of 14
4. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 1 of 14
5. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 1 of 14
6. (load p13 t0 l3)
   deleted: (at p13 l3)
   added: (in p13 t0)
   goals met: 1 of 14
7. (drive t0 l3 l0 level36 level3 level39)
   deleted: (at t0 l3) (fuel t0 level39)
   added: (at t0 l0) (fuel t0 level36)
   goals met: 1 of 14
8. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 2 of 14
9. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 2 of 14
10. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 2 of 14
11. (drive t0 l0 l2 level28 level8 level36)
   deleted: (at t0 l0) (fuel t0 level36)
   added: (at t0 l2) (fuel t0 level28)
   goals met: 2 of 14
12. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 2 of 14
13. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 2 of 14
14. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 2 of 14
15. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 2 of 14
16. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 2 of 14
17. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 2 of 14
18. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 3 of 14
19. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 4 of 14
20. (drive t0 l2 l0 level20 level8 level28)
   deleted: (at t0 l2) (fuel t0 level28)
   added: (at t0 l0) (fuel t0 level20)
   goals met: 4 of 14
21. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 5 of 14
22. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 6 of 14
23. (drive t0 l0 l3 level17 level3 level20)
   deleted: (at t0 l0) (fuel t0 level20)
   added: (at t0 l3) (fuel t0 level17)
   goals met: 6 of 14
24. (drive t0 l3 l1 level10 level7 level17)
   deleted: (at t0 l3) (fuel t0 level17)
   added: (at t0 l1) (fuel t0 level10)
   goals met: 6 of 14
25. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 6 of 14
26. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 6 of 14
27. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 7 of 14
28. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 8 of 14
29. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 9 of 14
30. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 10 of 14
31. (drive t0 l1 l3 level3 level7 level10)
   deleted: (at t0 l1) (fuel t0 level10)
   added: (at t0 l3) (fuel t0 level3)
   goals met: 10 of 14
32. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 11 of 14
33. (unload p12 t0 l3)
   deleted: (in p12 t0)
   added: (at p12 l3)
   goals met: 12 of 14
34. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 13 of 14
35. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 14 of 14
